app/Controllers/Admin/Pages.php

SELECT *
FROM `pages`
ORDER BY `id` DESC
---
    public function index()
    {
        $pageModel = new PageModel();

        $pages = $pageModel->orderBy('id', 'DESC')->findAll();

INSERT INTO `pages` (`page_key`, `status`, `created_at`, `updated_at`) VALUES ('1', 'draft', '2026-04-11 13:47:09', '2026-04-11 13:47:09')
---
    public function store()
    {
            // VALIDASI
        if (! $this->validate([
            'page_key' => 'required',
            'title_id' => 'required',
            'title_en' => 'required',
            'slug_id' => 'required',
            'slug_en' => 'required',
        ])) {
            return redirect()->back()->withInput()->with('errors', $this->validator->getErrors());
        }
        $pageModel = new PageModel();
        $translationModel = new PageTranslationModel();

        $pageId = $pageModel->insert([
            'page_key' => $this->request->getPost('page_key'),
            'status'   => $this->request->getPost('status'),
        ]);

INSERT INTO `page_translations` (`page_id`, `locale`, `slug`, `title`, `meta_title`, `meta_description`, `content`, `created_at`, `updated_at`) VALUES (1, 'id', 'tentang-kami', 'Tentang Kami', 'Nucoco', 'Test Tentang Kami', 'Teskonten indonesia', '2026-04-11 13:47:09', '2026-04-11 13:47:09')
---
        ];

        foreach ($translations as $locale => $data) {
            $translationModel->insert([
                'page_id'          => $pageId,
                'locale'           => $locale,
                'slug'             => $data['slug'],
                'title'            => $data['title'],
                'meta_title'       => $data['meta_title'],
                'meta_description' => $data['meta_description'],
                'content'          => $data['content'],
            ]);

SELECT *
FROM `pages`
WHERE `pages`.`id` = 1
---
    public function edit(int $id)
    {
        $pageModel = new PageModel();
        $translationModel = new PageTranslationModel();

        $page = $pageModel->find($id);

SELECT *
FROM `page_translations`
WHERE `page_id` = 1
AND `locale` = 'id'
 LIMIT 1
UPDATE `page_translations` SET `slug` = 'tentang-kami', `title` = 'Tentang Kami', `meta_title` = 'Nucoco', `meta_description` = 'Test Tentang Kami', `content` = 'Teskonten indonesia', `updated_at` = '2026-04-11 13:47:24'
WHERE `page_translations`.`id` IN ('1')
---
    public function update(int $id)
    {
        $pageModel = new PageModel();
        $translationModel = new PageTranslationModel();

        $pageModel->update($id, [
            'page_key' => $this->request->getPost('page_key'),
            'status'   => $this->request->getPost('status'),
        ]);

        foreach (['id', 'en'] as $locale) {
            $existing = $translationModel
                ->where('page_id', $id)
                ->where('locale', $locale)
                ->first();

            $data = [
                'slug'             => $this->request->getPost("slug_{$locale}"),
                'title'            => $this->request->getPost("title_{$locale}"),
                'meta_title'       => $this->request->getPost("meta_title_{$locale}"),
                'meta_description' => $this->request->getPost("meta_description_{$locale}"),
                'content'          => $this->request->getPost("content_{$locale}"),
            ];

            if ($existing) {
                $translationModel->update($existing['id'], $data);