app/Models/PageTranslationModel.php

    public function getByLocaleAndSlug(string $locale, string $slug): ?array
    {
        return $this->select('page_translations.*, pages.status, pages.page_key')
            ->join('pages', 'pages.id = page_translations.page_id')
            ->where('page_translations.locale', $locale)
            ->where('page_translations.slug', $slug)
            ->where('pages.status', 'publish')
            ->first();
---
SELECT `page_translations`.*, `pages`.`status`, `pages`.`page_key`
FROM `page_translations`
JOIN `pages` ON `pages`.`id` = `page_translations`.`page_id`
WHERE `page_translations`.`locale` = 'id'
AND `page_translations`.`slug` = 'tentang-kami'
AND `pages`.`status` = 'publish'
 LIMIT 1

    public function getByPageId(int $pageId): array
    {
        return $this->where('page_id', $pageId)->findAll();
---
SELECT *
FROM `page_translations`
WHERE `page_id` = 1